# [Arithmetic Mean, Geometric Mean, Weighted Mean, Harmonic Mean, Root Mean Square Formula - Statistics](https://www.youtube.com/watch?v=6G6i8vSa8Zs&list=PL0o_zxa4K1BVsziIRdfv4Hl4UIqDZhXWV&index=9&ab_channel=TheOrganicChemistryTutor)

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = [2, 5, 8, 11, 14, 17, 20]
df = pd.DataFrame(data)
df

    0
0   2
1   5
2   8
3  11
4  14
5  17
6  20

In [3]:
df.mean()

0    11.0
dtype: float64

In [4]:
data = [3, 6, 12, 24, 48, 96, 192]
df = pd.DataFrame(data)
df

     0
0    3
1    6
2   12
3   24
4   48
5   96
6  192

In [5]:
# https://www.tutorialspoint.com/find-the-geometric-mean-of-a-given-pandas-dataframe
np.exp(np.log(df).mean())

0    24.0
dtype: float64

In [6]:
data = [1/2, 1/5, 1/8, 1/11, 1/14, 1/17, 1/20]
df = pd.DataFrame(data)
df

          0
0  0.500000
1  0.200000
2  0.125000
3  0.090909
4  0.071429
5  0.058824
6  0.050000

In [7]:
# https://www.trymito.io/excel-to-python/functions/math/AVERAGE
# 1/11 = 0.090909091
len(df) / (1 / df[0]).sum()

0.09090909090909091

In [8]:
data = {
    'p': [0, 0, 0, 0, 0],
    'x': [5, 8, 12, 16, 21],
}
df = pd.DataFrame(data)
df

   p   x
0  0   5
1  0   8
2  0  12
3  0  16
4  0  21

In [9]:
# https://stackoverflow.com/questions/41328922/python-pandas-simple-example-of-calculating-rmse-from-data-frame
((df.p - df.x) ** 2).mean() ** .5

13.638181696985855